const { bot } = require("../bot");
const {
  clearSessionById,
  createSession,
  setSessionStep,
  getSessionByChatID,
} = require("../sessions");
const { tryCatch } = require("../utils");
const {
  bigMainKeyboard,
  smallOurDirectionsButton,
  smallRegistrationButton,
  bigAllDirectionsKeyboard,
  shareNumberKeyboard,
  smallPreferWayToContactKeyboard,
} = require("../keyboards/index");
const { STEP } = require("./steps");
const { CHATS } = require("../secret");

module.exports = {
  step_start: (chatId, from) => {
    tryCatch(() => {
      clearSessionById(chatId);
      createSession(chatId, from);
      bot.sendMessage(
        chatId,
        `Добрый день, меня зовут Варя, ваш бот ассистент. Я помогу подобрать направление и записать вас на пробное занятие.
        
Нажмите на кнопку познакомится с направлениями, и я вам подробно расскажу о каждом`,
        bigMainKeyboard()
      );
    });
  },
  step_whereWeAre: (chatId) => {
    bot.sendMessage(
      chatId,
      `Наш адрес м. Бибирево, ул. Пришвина 8, Бизнес Центр РТС, 1 этаж, 102 помещение`,
      smallOurDirectionsButton()
    );

    return;
  },

  step_ourDirections: (chatId) => {
    bot.sendMessage(chatId, `Наши направления`, bigAllDirectionsKeyboard());
  },

  step_yoga: (chatId) => {
    bot.sendMessage(
      chatId,
      `Йога

Занятия включают в себя:
       
  •  специальные позы (асаны), которые расслабляют тело, увеличивают его гибкость и укрепляют мышцы.
  • дыхательные упражнения, которые помогут увеличить объем легких, укрепят дыхательную мускулатуру, увеличат приток кислорода в организм, улучшат деятельность сердечно-сосудистой системы и внутренних органов.
      
Йога – позволит вам достичь гармонию в здоровье и эмоциях.
      
Если у вас:
  •  бессонница
  •  тревожность и стресс
  •  боли в спине, шее и голове
  •  потеря концентрации
  •  частые простуды
      
Занятия йогой помогут вам:
    •  избавиться от головной боли
    •  приобрести красивую фигуру
    •  снять отеки
    •  сформировать правильную осанку
    •  повысить иммунитет
    •  оздоровить кожу и иметь свежий вид
    •  улучшить сон
    •  повысить внимание и концентрацию
    •  избавиться от стресса.`,
      smallRegistrationButton()
    );
  },
  step_rastyajka: (chatId) => {
    bot.sendMessage(
      chatId,
      `Растяжка - это комплекс упражнений для развития гибкости, подвижности в суставах, эластичности мышц.
      
Если вы хотите:
  - убрать боль и зажатость в мышцах
  -поддерживать здоровье
  -привести мышцы в тонус
  -сесть на шпагат
      
После посещений занятий по направлению "Растяжка" :
  -появится приятное чувство гибкости
  -приобретёте хорошее самочувствие
  -получите заряд бодрости
  -почувствуете легкость в теле`,
      smallRegistrationButton()
    );
  },
  step_aero: (chatId) => {
    bot.sendMessage(
      chatId,
      `Аэро -  занятие в гамаках.

Функциональные упражнения с акцентом на комплексную растяжку всего тела.
      
Во время выполнения элементов на гамаках идет проработка мышц всего тела.
      
Занятие в гамаках поможет вам:
      
  • снять накопленный стресс и усталость
  • укрепить мышцы пресса
  • устранить напряжение и болевые ощущения в спине
  • улучшить лимфодренаж
  • похудеть, улучшить осанку
  • вытянуть позвоночник`,
      smallRegistrationButton()
    );
  },
  step_healthySpine: (chatId) => {
    bot.sendMessage(
      chatId,
      `Здоровая спина - это тренировка 2в1, направленная на растяжку и укрепление мышц корпуса. Физические упражнения для спины рассчитаны на любой возраст и любой уровень подготовки.
      
Если вы хотите:
  -подтянуть мышцы живота
  -избавиться от боли в спине
  -выровнять осанку
  -сохранить длинную и красивую шею
  -улучшить самочувствие
      
После посещений занятий по направлению "Здоровая спина":
  -получите красивую, ровную осанку
  -подтяните мышцы лица
  -избавитесь от болей в спине
  -почувствуете легкость в теле
  -уберёте напряжение`,
      smallRegistrationButton()
    );
  },
  step_mfr: (chatId) => {
    bot.sendMessage(
      chatId,
      `МФР тренировка - это направленное воздействие на мышцы при помощи специального оборудования.
    
Если у вас:
  -боли в спине
  -боли в ягодицах
  -напряжена шея/трапеция
  -защемлен седалищный нерв
  -при занятиях растяжкой чувствуется скованность в движениях
    
После посещения занятия МФР:
  -сможете легче растягиваться
  -получите лимфодренажный эффект
  -избавитесь от болевых ощущений в теле
    
На занятии расслабим напряженные мышцы и фасции,используя специальные массажные роллы и мячи`,
      smallRegistrationButton()
    );
  },
  step_pilates: (chatId) => {
    bot.sendMessage(
      chatId,
      `Пилатес

Это комплекс гимнастических упражнений, направленный не на развитие физической силы, а на подтяжку мышц тела, приведение организма в тонус, а также служащий для общего оздоровления организма.
    
Основная цель занятий – восстановление подвижности, естественной гибкости позвоночника, суставов и укрепление мышечного корсета.
    
Занятия пилатесом эффективно подтягивают фигуру, улучшают осанку и качество тела.
    
Заниматься пилатесом можно в любом возрасте и с любой физической подготовкой.
    
Благодаря занятиям вы получите:
  •  красивое гибкое тело
  •  ровную осанку
  •  тонус в мышцах
  •  лёгкость в спине и суставах
  •  Ну, и конечно – чувство удовлетворения от своего внешнего вида и хорошего самочувствия
    
Занятия по пилатесу подойдут вам, если вы хотите:
  •  избавиться от боли в спине и пояснице
  •  улучшить координацию и баланс тела
  •  нормализовать сон, избавиться от ощущения беспокойства
  •  обрести гибкость и свободу движений
  •  придать рельеф телу
  •  подтянуть мышцы`,
      smallRegistrationButton()
    );
  },
  step_registration: (chatId) => {
    bot.sendMessage(chatId, `Введите ваше имя`);
    setSessionStep(chatId, STEP.REQUEST_PHONE);
  },

  step_requestPhone: (chatId) => {
    bot.sendMessage(
      chatId,
      `Оставьте свой номер телефона и мы свяжемся с вами в течение 5 минут`,
      shareNumberKeyboard()
    );
    setSessionStep(chatId, STEP.PREFER_WAY_TO_CONTACT);
  },

  step_preferWayToContact: (chatId) => {
    bot.sendMessage(
      chatId,
      `Выберите удобный способ связи`,
      smallPreferWayToContactKeyboard()
    );
    setSessionStep(chatId, STEP.END);
  },

  step_end: (chatId, msg) => {
    tryCatch(() => {
      const { name, phone, preferWayToContact } = getSessionByChatID(chatId);

      if (!name || !phone || !preferWayToContact) {
        bot.sendMessage(
          CHATS.MAIN,
          `Пользователь пошёл не по карте

${JSON.stringify(msg.from)}`,
          {
            message_thread_id: CHATS.LOGS,
          }
        );
        return;
      }

      bot.sendMessage(
        chatId,
        `Благодарим вас за заявку, менеджер свяжется с вами в течении 5 минут
  
Наш адрес м. Бибирево, ул.
Пришвина 8, Бизнес Центр
РТС, 1 этаж, 102 помещение`,
        bigMainKeyboard()
      );

      bot.sendMessage(
        CHATS.MAIN,
        `Новая заявка!
  
Имя: ${name},
Телефон: ${phone},
Связаться с помощью: ${preferWayToContact}
  `);

      bot.sendMessage(
        CHATS.MAIN,
        `Оставлена заявка ${JSON.stringify(msg.from)}`,
        {
          message_thread_id: CHATS.LOGS,
        }
      );
      clearSessionById(chatId);
    });
  },
};
